import React from "react";

function Information() {
  return (
    <div className="w-full bg-gray-100/50 text-black p-10">
      <h2 className="text-4xl md:text-5xl font-bold text-center  mt-5 text-black text-shadow-sm mb-4">
        Information
      </h2>
      <section id="experience" className="py-10 md:px-20 mx-auto grid grid-cols-1 md:grid-cols-2 gap-5">
        <div>
          <h1 className="font-bold">ราคาบ้านพัก</h1>
          <h1>
            - 4,500 บาท / 9 ท่าน <br />
            - เตียงเสริม ท่านละ 500 บาท
          </h1>
        </div>
        <div>
          <h1 className="font-bold">รายละเอียดเพิ่มเติม</h1>
          <h1>
            - เกินเสริมท่านละ 500 บาท
            <br />
            - พักได้สูงสุด 15 ท่าน <br />
            - ค่าประกันบ้าน 2,250 บาท  (จ่าย ณ วันเข้าพัก)
            <br />
            - หากโอนจองบ้านพักแล้ว ทางเราขอสงวนสิทธิ์ยกเลิกการจอง
            แต่สามารถเลื่อนวันเข้าพักได้**
            <br />
          </h1>
        </div>

        <div>
          <h1 className="font-bold">กฎระเบียบบ้านพัก</h1>
          <h1>
            🚫 ห้ามสูบบุหรี่ภายในตัวบ้านพัก
            <br />
            🚫 งดส่งเสียงดังหลัง 21:00 น. (ภายนอกบ้านพัก) <br />
            🚫 ห้ามเข้าพักเกินจำนวนที่จอง + กำหนดไว้
            <br />
            🚫 ห้ามนำสัตว์เลี้ยงเข้าบ้านพัก
            <br />
          </h1>
        </div>
        <div >
          <p className="font-bold">สนใจที่พักติดต่อ</p>
          <div className="flex gap-2">

          <span><svg width="32px" height="32px" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <path d="M30 14.4979C30 8.15792 23.7199 3 15.9999 3C8.28094 3 2 8.15792 2 14.4979C2 20.1817 6.98063 24.9417 13.7084 25.8418C14.1644 25.9412 14.7849 26.146 14.9419 26.5404C15.0831 26.8986 15.0342 27.4598 14.987 27.8216C14.987 27.8216 14.8227 28.8214 14.7873 29.0343C14.7264 29.3926 14.5061 30.4353 15.9999 29.7981C17.4942 29.1609 24.0626 24.9935 26.9998 21.572C29.0287 19.3204 30 17.0353 30 14.4979Z" fill="#2CCF54"></path> <path d="M13.1553 11.4244H12.1733C12.0228 11.4244 11.9004 11.5478 11.9004 11.6995V17.866C11.9004 18.0179 12.0228 18.1411 12.1733 18.1411H13.1553C13.3059 18.1411 13.428 18.0179 13.428 17.866V11.6995C13.428 11.5478 13.3059 11.4244 13.1553 11.4244Z" fill="white"></path> <path d="M19.9147 11.4244H18.9327C18.7821 11.4244 18.66 11.5478 18.66 11.6995V15.3631L15.8645 11.5467C15.8128 11.4683 15.729 11.4295 15.6375 11.4244H14.6558C14.5052 11.4244 14.3828 11.5478 14.3828 11.6995V17.866C14.3828 18.0179 14.5052 18.1411 14.6558 18.1411H15.6375C15.7883 18.1411 15.9104 18.0179 15.9104 17.866V14.2035L18.7094 18.0247C18.7597 18.0967 18.845 18.1411 18.9327 18.1411H19.9147C20.0655 18.1411 20.1874 18.0179 20.1874 17.866V11.6995C20.1874 11.5478 20.0655 11.4244 19.9147 11.4244Z" fill="white"></path> <path d="M10.7884 16.5969H8.12013V11.6998C8.12013 11.5476 7.99802 11.4241 7.84773 11.4241H6.86545C6.71489 11.4241 6.59277 11.5476 6.59277 11.6998V17.8652C6.59277 18.0149 6.71435 18.1411 6.86518 18.1411H10.7884C10.9389 18.1411 11.0605 18.0174 11.0605 17.8652V16.8725C11.0605 16.7203 10.9389 16.5969 10.7884 16.5969Z" fill="white"></path> <path d="M25.3372 12.9683C25.4878 12.9683 25.6094 12.8452 25.6094 12.6927V11.7C25.6094 11.5478 25.4878 11.4241 25.3372 11.4241H21.4143C21.2636 11.4241 21.1416 11.5501 21.1416 11.6998V17.8655C21.1416 18.0147 21.2633 18.1411 21.4137 18.1411H25.3372C25.4878 18.1411 25.6094 18.0174 25.6094 17.8655V16.8725C25.6094 16.7206 25.4878 16.5969 25.3372 16.5969H22.6692V15.5546H25.3372C25.4878 15.5546 25.6094 15.4311 25.6094 15.2789V14.2863C25.6094 14.1341 25.4878 14.0104 25.3372 14.0104H22.6692V12.9683H25.3372Z" fill="white"></path> </g></svg></span>
          <span>@SPGuestHouse</span>
          </div>
          <div className="flex gap-2">
          <svg fill="#000000" height="32px" width="32px" version="1.1" id="Icons" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 32 32" xml:space="preserve"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <g> <path d="M29,17h-5.4c-1.8,0-3.2-1.5-3.2-3.3c0-0.3,0-0.7-1.1-0.7h-6.6c-1.1,0-1.1,0.4-1.1,0.7c0,1.8-1.4,3.3-3.2,3.3H3 c-0.6,0-1-0.4-1-1c0-5,3.9-9,8.6-9h10.8c4.7,0,8.6,4,8.6,9C30,16.6,29.6,17,29,17z"></path> </g> <path d="M23.6,19c-2.4,0-4.5-1.7-5.1-4h-5.2c-0.6,2.3-2.6,4-5.1,4h-1C6.1,21.4,5,24.4,5,27c0,0.6,0.4,1,1,1h20c0.6,0,1-0.4,1-1 c0-2.6-1.1-5.6-2.3-8H23.6z M16,25c-2.2,0-4-1.8-4-4s1.8-4,4-4s4,1.8,4,4S18.2,25,16,25z"></path> <path d="M23,30c-0.6,0-1-0.4-1-1v-2c0-0.6,0.4-1,1-1s1,0.4,1,1v2C24,29.6,23.6,30,23,30z"></path> <path d="M9,30c-0.6,0-1-0.4-1-1v-2c0-0.6,0.4-1,1-1s1,0.4,1,1v2C10,29.6,9.6,30,9,30z"></path> </g></svg>
          <span>โทร 081-165-6688 (คุณแสง)</span>
          </div>
        </div>
      </section>
    </div>
  );
}

export default Information;
